In [3]:
import pandas as pd
import numpy as np
from pydataset import data
import matplotlib.pyplot as plt

# Exercises 1

## 1. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [78]:
from env import host, user, password

In [68]:
def get_db_url(user, host, password, dbname):
    url = f'mysql+pymysql://{user}:{password}@{host}/{dbname}'
    return url

## 2.Use your function to obtain a connection to the employees database.

In [70]:
url = get_db_url(user, host, password, 'employees')

In [42]:
## 3. Once you have successfully run a query:

pd.read_sql('SELECT * FROM salaries LIMIT 5 OFFSET 50', url)

   emp_no  salary   from_date     to_date
0   10005   85076  1993-09-11  1994-09-11
1   10005   86050  1994-09-11  1995-09-11
2   10005   88448  1995-09-11  1996-09-10
3   10005   88063  1996-09-10  1997-09-10
4   10005   89724  1997-09-10  1998-09-10

### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [71]:
url2=get_db_url(user, host, password, 'empoyees')

In [75]:
# pd.read_sql('SELECT * FROM salaries LIMIT 5 OFFSET 50', url2)
# returns OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'xyz'@'%' to database 'empoyees'")

### b. Intentionally make an error in your SQL query. What does the error message look like?

In [76]:
# pd.read_sql('SELECT * FOM salaries LIMIT 5 OFFSET 50', url)
# returns ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax
# to use near 'FOM salaries LIMIT 5 OFFSET 50' at line 1")

## 4. Read the employees and titles tables into two separate DataFrames.

In [77]:
emp_df = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
type(emp_df)

pandas.core.frame.DataFrame

In [51]:
emp_df

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [53]:
titles_df = pd.read_sql('SELECT * FROM titles LIMIT 5 OFFSET 50', url)
titles_df

   emp_no            title   from_date     to_date
0   10036     Senior Staff  1992-04-28  9999-01-01
1   10037         Engineer  1990-12-05  1995-12-05
2   10037  Senior Engineer  1995-12-05  9999-01-01
3   10038     Senior Staff  1996-09-20  9999-01-01
4   10038            Staff  1989-09-20  1996-09-20

## 5. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [54]:
titles_df.shape

(5, 4)

In [55]:
emp_df.shape

(5, 6)

## 6. Display the summary statistics for each DataFrame.

In [56]:
titles_df.describe()

            emp_no
count      5.00000
mean   10037.20000
std        0.83666
min    10036.00000
25%    10037.00000
50%    10037.00000
75%    10038.00000
max    10038.00000

In [57]:
emp_df.describe()

             emp_no
count      5.000000
mean   10053.000000
std        1.581139
min    10051.000000
25%    10052.000000
50%    10053.000000
75%    10054.000000
max    10055.000000

## 7. How many unique titles are in the titles DataFrame?

In [61]:
titles_df.title.unique()

array(['Senior Staff', 'Engineer', 'Senior Engineer', 'Staff'],
      dtype=object)

## 8. What is the oldest date in the to_date column?

In [65]:
titles_df.sort_values(by = ['to_date']).head(1)

   emp_no     title   from_date     to_date
1   10037  Engineer  1990-12-05  1995-12-05

## 9. What is the most recent date in the to_date column?

In [67]:
titles_df.sort_values(by = 'to_date', ascending=False).head(1)

   emp_no         title   from_date     to_date
0   10036  Senior Staff  1992-04-28  9999-01-01